In [135]:
%pip install pandas
%pip install numpy

Requirement already satisfied: pandas in c:\python311\lib\site-packages (2.1.1)
Requirement already satisfied: numpy>=1.23.2 in c:\python311\lib\site-packages (from pandas) (1.26.0)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\danil\appdata\roaming\python\python311\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\python311\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\python311\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in c:\users\danil\appdata\roaming\python\python311\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.3 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: numpy in c:\python311\lib\site-packages (1.26.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 23.3 -> 23.3.1
[notice] To update, run: python.exe -m pip install --upgrade pip

In [136]:
import pandas as pd
import numpy as np

In [137]:
rides_data = pd.read_csv("rides_go.csv")
subscription_types_data = pd.read_csv("subscriptions_go.csv")
users_data = pd.read_csv("users_go.csv")

In [138]:
rides_data.head()

   user_id     distance   duration        date
0        1  4409.919140  25.599769  2021-01-01
1        1  2617.592153  15.816871  2021-01-18
2        1   754.159807   6.232113  2021-04-20
3        1  2694.783254  18.511000  2021-08-11
4        1  4028.687306  26.265803  2021-08-28

In [139]:
users_data.head()

   user_id        name  age            city subscription_type
0        1        Кира   22          Тюмень             ultra
1        2   Станислав   31            Омск             ultra
2        3     Алексей   20          Москва             ultra
3        4  Константин   26  Ростов-на-Дону             ultra
4        5       Адель   28            Омск             ultra

In [140]:
users_data["subscription_type"].unique()

array(['ultra', 'free'], dtype=object)

In [141]:
subscription_types_data.head()

  subscription_type  minute_price  start_ride_price  subscription_fee
0              free             8                50                 0
1             ultra             6                 0               199

## Будет ли помесячная выручка от пользователей с подпиской по месяцам выше, чем выручка от пользователей без подписки?

In [142]:
combined_data = pd.merge(rides_data, users_data, on="user_id")

In [161]:
combined_data.head()

,user_id,distance,duration,date,name,age,city,subscription_type
0,1,4409.919140,25.599769,2021-01-01,Кира,22,Тюмень,ultra
1,1,2617.592153,15.816871,2021-01-18,Кира,22,Тюмень,ultra
2,1,754.159807,6.232113,2021-04-20,Кира,22,Тюмень,ultra
3,1,2694.783254,18.511000,2021-08-11,Кира,22,Тюмень,ultra
4,1,4028.687306,26.265803,2021-08-28,Кира,22,Тюмень,ultra

In [144]:
rides_count = combined_data["user_id"].value_counts()
rides_duration = None

In [145]:
rides_user_data = rides_count.reset_index()

In [146]:
rides_user_data = pd.merge(rides_user_data, users_data.drop_duplicates("user_id"), on="user_id")

In [159]:
rides_user_data.sample(10)

      user_id  count       name  age            city subscription_type
200      1032     17     Галина   27    Екатеринбург              free
986      1336     10      Роман   20          Тюмень              free
158      1087     18       Петр   29  Ростов-на-Дону              free
1230      447      8       Майя   19          Москва             ultra
260      1275     16   Виталина   26          Тюмень              free
1049      680     10    Тимофей   33  Ростов-на-Дону             ultra
1061      541     10     Родион   28       Краснодар             ultra
1029      524     10  Екатерина   19            Сочи             ultra
1095     1243      9     Эдуард   31          Москва              free
546      1265     13      Роман   24    Екатеринбург              free